## Pandas-DataFrame and Series

Panda is a powerful data manupulation lib in python, widely used for data analysis and data cleaning.it provides two primary data structure:Series and DataFrame.A series is a one-dimensional array-like object,while a DataFrame is a two-dimesional, size-mutable, and potentially heterogenoes tabular data structure with labeled axes(rows and colums)

In [2]:
import pandas as pd

In [ ]:
## Series
## A series is a one-dimensional array-like object that can hold any data type,It is similar to a colum in a table.

data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [9]:
## Create a Series from dictionary

data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [11]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [12]:
## DataFrame 
## From dictionary of list

data={
    'Name':['Krish','John','Jack'],
    'Age':[25,30,45],
    'City':['Banglore','New York','Florida']
}
 
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age      City
0  Krish   25  Banglore
1   John   30  New York
2   Jack   45   Florida
<class 'pandas.core.frame.DataFrame'>

In [13]:
import numpy as np
np.array(df)

array([['Krish', 25, 'Banglore'],
       ['John', 30, 'New York'],
       ['Jack', 45, 'Florida']], dtype=object)

In [3]:
##Create a Data from a List of Dictionaries

data=[
    {'Name':'Krish','Age':32,'City':'Banglore'},
    {'Name':'John','Age':32,'City':'Banglore'},
    {'Name':'Bappy','Age':32,'City':'Banglore'},
    {'Name':'Jack','Age':32,'City':'Banglore'},
]

df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age      City
0  Krish   32  Banglore
1   John   32  Banglore
2  Bappy   32  Banglore
3   Jack   32  Banglore
<class 'pandas.core.frame.DataFrame'>

In [62]:
df=pd.read_csv('sale_data.csv')
df.head(5)##First 5 data

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
0,1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
1,2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
2,3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath
3,4,A31Bee3c201ef58,Yesenia,Martinez,Male,kaitlinkaiser@example.com,584.094.6111,2017-08-03,Market researcher
4,5,1bA7A3dc874da3c,Lori,Todd,Male,buchananmanuel@example.net,689-207-3558x7233,1938-12-01,Veterinary surgeon

In [ ]:
df.tail(5)##Last 5 data

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
95,96,5eFda7caAeB260E,Dennis,Barnes,Female,bmartin@example.org,001-095-524-2112x257,1954-07-30,Software engineer
96,97,CCbFce93d3720bE,Steve,Patterson,Female,latasha46@example.net,001-865-478-5157,1932-04-29,Barrister
97,98,2fEc528aFAF0b69,Wesley,Bray,Male,regina11@example.org,995-542-3004x76800,1994-12-28,Police officer
98,99,Adc7ad9B6e4A1Fe,Summer,Oconnell,Female,alexiscantrell@example.org,001-273-685-6932x092,2012-04-12,Broadcast journalist
99,100,b8D0aD3490FC7e1,Mariah,Bernard,Male,pcopeland@example.org,(341)594-6554x44657,2016-11-15,IT sales professional

In [4]:
df

    Name  Age      City
0  Krish   32  Banglore
1   John   32  Banglore
2  Bappy   32  Banglore
3   Jack   32  Banglore

In [6]:
df['Name']

0    Krish
1     John
2    Bappy
3     Jack
Name: Name, dtype: object

In [33]:
type(df['Name'])

pandas.core.series.Series

In [34]:
##loc- 0th row
df.loc[0]

Name       Krish
Age           32
City    Banglore
Name: 0, dtype: object

In [35]:
df.iloc[0]

Name       Krish
Age           32
City    Banglore
Name: 0, dtype: object

In [ ]:
## Accesing a specified element
df.at[2,'Name']

'Bappy'

In [41]:
## Accessing a specified element using iat
df.iat[2,2]

'Banglore'

In [47]:
## Data Manipulation with DataFrame
df

    Name  Age      City
0  Krish   32  Banglore
1   John   32  Banglore
2  Bappy   32  Banglore
3   Jack   32  Banglore

In [48]:
## Adding a column
df['Salary']=[5000,6000,7000,8000]
df

    Name  Age      City  Salary
0  Krish   32  Banglore    5000
1   John   32  Banglore    6000
2  Bappy   32  Banglore    7000
3   Jack   32  Banglore    8000

In [51]:
##Remove a column
##There are 2 axis -> axis=0 for row and axis=1 for column
##Doesnt save the operation so we use inplase
df.drop('Salary',axis=1,inplace=True)

In [58]:
df

    Name  Age      City
0  Krish   32  Banglore
1   John   32  Banglore
2  Bappy   32  Banglore
3   Jack   32  Banglore

In [60]:
##Add age to the column
df['Age']=df['Age']+1
df

    Name  Age      City
0  Krish   34  Banglore
1   John   34  Banglore
2  Bappy   34  Banglore
3   Jack   34  Banglore

In [61]:
##Drop based on row
df.drop(0,inplace=True)
df

    Name  Age      City
1   John   34  Banglore
2  Bappy   34  Banglore
3   Jack   34  Banglore

In [ ]:
df.describe()

            Index
count  100.000000
mean    50.500000
std     29.011492
min      1.000000
25%     25.750000
50%     50.500000
75%     75.250000
max    100.000000